{
  "locale": {
    "lang": "fr",
    "date-format": "DD/MM/Y"
  },
  "moment": {
    "unknown-date": "Date indéfinie"
  },
  "first-day-of-week": "1",
  "login": {
    "login": "Identifiant",
    "password": "Mot de passe",
    "forgotten-password": "Mot de passe oublié ?",
    "connection": "Connexion",
    "gcu": "Conditions générales d'utilisation",
    "back": "Retour"
  },
  "firstLogin": {
    "title": "Bienvenue sur TEZOS DigiSign.",
    "message1": "Avant votre première connexion, merci de choisir",
    "message2": "un mot de passe et de confirmer votre choix.",
    "password": "Créer mon mot de passe",
    "passwordConfirmation": "Confirmation du mot de passe",
    "activate": "Activer mon compte",
    "passwordError": "Les mots de passe doivent correspondre et comporter au moins 8 caractères, dont 1 caractère minuscule, 1 caractère majuscule, 1 chiffre et 1 caractère spécial",
    "alreadyActivated": {
      "title": "Erreur",
      "message1": "L'hyperlien de confirmation n'est plus valide ou a déjà été utilisé.",
      "message2": "Nous vous invitons à contacter votre administrateur."
    }
  },
  "dashboard": {
    "title": "Tableau de bord",
    "welcome": "Bienvenue sur application Tezos Digisign !",
    "content": "Grâce à cette application, vous serez capable de créer vos jobs et d'ajouter vos documents pour qu'ils soient signés. Vous pourrez également vérifier l'authenticité de vos documents.",
    "lastJobs": "Derniers jobs",
    "documentsSigned": "documents signés",
    "jobsCreated": "jobs créés",
    "jobsProcessed": "jobs éxécutés",
    "monthStatistics": "Statistiques de {0}",
    "more": "Voir plus"
  },
  "account": {
    "list": {
      "title": "Gestion des utilisateurs",
      "fullName": "Nom complet",
      "email": "Email",
      "isAdmin": "Administrateur",
      "add": "Ajouter",
      "login": "Identifiant",
      "lastName": "Nom",
      "firstName": "Prénom",
      "status": "Statut",
      "cancel": "Annuler"
    },
    "edit": {
      "title": {
        "manage": "Gestion des utilisateurs",
        "profile": "Mon compte"
      },
      "subTitle": {
        "create": "Créer un utilisateur",
        "edit": "Editer un utilisateur"
      },
      "login": "Identifiant",
      "email": "Email",
      "profile": "Profil",
      "TEZOSPubKey": "Clé publique TEZOS",
      "TEZOSAccount": "Compte TEZOS",
      "fullName": "Nom complet",
      "password": "Mot de passe",
      "newPassword": "Nouveau mot de passe",
      "newPasswordConfirmation": "Confirmer nouveau mot de passe",
      "save": "Sauvegarder",
      "admin": "Administrateur",
      "noAdmin": "Utilisateur",
      "updated": "Les informations ont été mises à jour.",
      "country": "Pays",
      "company": "Entreprise",
      "mandatory": "* Ces informations sont obligatoires."
    }
  },
  "job": {
    "detail": {
      "title": "Détails du Job",
      "back": "Retour",
      "id": "ID",
      "name": "Nom",
      "date": "Date de création",
      "statusDate": "Date de statut",
      "status": "Statut",
      "docs": "Docs",
      "channel": "Canal",
      "block": "Blocks",
      "transaction": "Transaction",
      "hash": "Algorithme de hachage",
      "rootHash": "Racine de hachage"
    },
    "list": {
      "title": "Liste des jobs",
      "id": "ID",
      "name": "Nom",
      "creationDate": "Date de création",
      "statusDate": "Date de statut",
      "status": "Statut",
      "docs": "Docs",
      "channel": "Canal",
      "dates": "Date de création",
      "search": "Rechercher",
      "records": "résultats",
      "export": "Exporter .csv",
      "copyId": "Copier"
    }
  },
  "channelManagement": {
    "title": "Gestion des canaux",
    "new": "Nouveau token",
    "all": "Tous les tokens",
    "name": "Nom",
    "creationDate": "Date",
    "expirationDate": "Date d'expiration",
    "add": "Créer",
    "revoke": "Révoquer",
    "date": "Date",
    "tokenJwt": "Token",
    "copyToken": "Copier"
  },
  "menu": {
    "dashboard": "Tableau de bord",
    "jobs": "Liste des jobs",
    "documents": "Listes des documents",
    "signatureRequest": "Requête de signature",
    "signatureCheck": "Vérification de signature",
    "resources": "Ressources",
    "settings": "Paramètres",
    "hello": "Bonjour",
    "profile": "Mon compte",
    "channelManagement": "Gestion des canaux",
    "login": "Connexion",
    "logout": "Déconnexion"
  },
  "documents": {
    "title": "Liste des documents",
    "jobId": "Job concerné",
    "hash": "Hash du document",
    "name": "Nom du document",
    "dates": "Date de création",
    "proof": "Preuve",
    "search": "Rechercher",
    "back": "Retour",
    "records": "résultats"
  },
  "signatureCheck": {
    "hash": "Hash du document",
    "check": "Vérifier vos fichiers",
    "about": "A propos",
    "contact": "Contactez nous",
    "unknown": "Organisation inconnue",
    "title": "Bienvenue sur la page de vérification de Tezos DigiSign.",
    "subtitle": "Vous pouvez ici vérifier l'authenticité des documents signés à l'aide du protocole et des outils Tezos DigiSign.",
    "text1": "Nous vous invitons à glisser-déposer ou à télécharger le fichier que vous souhaitez vérifier. Si ce fichier a été signé par Sword Group ou par un partenaire de Sword Group qui nous a informé de leurs signatures, et si ce fichier n'a pas été modifié depuis sa signature, nous vous confirmerons immédiatement son authenticité.",
    "text2": "Si notre plateforme ne reconnaît pas le fichier, mais si vous savez que le fichier a été certifié en utilisant Tezos DigiSign, vous devriez avoir reçu un document de preuve. Ce document, au format JSON, nous donnera toutes les informations dont nous avons besoin pour vérifier l'authenticité du document. Dans ce cas, nous vous invitons à télécharger à la fois le fichier à vérifier et le document de preuve avant de cliquer sur le bouton de vérification.",
    "upload": "Téléversez votre fichier",
    "uploadProof": "Téléversez votre fichier de preuve",
    "optional": "(optionnel)",
    "generate": "Vérifier votre document",
    "regenerate": "Vérifier un nouveau document",
    "drop": "Déposez ici votre fichier",
    "com": "SWORD. Tous droits réservés.",
    "GCU": "Conditions générales d'utilisation",
    "policy": "Politique de protection de la vie privée",
    "more": "Plus",
    "here": "ici",
    "errors": {
      "hash_not_present": {
        "title": "Hachage de document introuvable dans TEZOS DigiSign",
        "message": "Nous sommes désolés, nous ne reconnaissons pas ce document. Êtes-vous sûr que ce document est dans la même version que celle qui a été signée? Sinon, veuillez télécharger la version originale. Si le document est bon et si vous avez reçu un fichier de preuve, veuillez également le télécharger. "
      },
      "hash_inconsistent": {
        "title": "Le fichier de preuve ne correspond pas au document",
        "message": "Nous sommes désolés, le fichier de preuve que vous avez fourni ne correspond pas au document que vous souhaitez vérifier (hachage du document {0} vs code de hachage du fichier de preuve {1}). Nous vous invitons à télécharger le fichier de preuve correct. Si vous ne disposez pas d'un autre fichier de preuve, le document que vous souhaitez confirmer peut avoir été modifié depuis sa signature. Nous vous invitons dans ce cas à retrouver sa version d'origine et à réessayer. "
      },
      "incorrect_root_hash": {
        "title": "Le fichier de preuve ne correspond pas au document",
        "message": "Nous sommes désolés, le fichier de preuve que vous avez fourni contient une erreur dans le calcul de son arbre Merkel. Êtes-vous sûr que ce fichier de preuve a été généré par un outil respectant le protocole Tezos DigiSign?"
      },
      "unknown_root_hash": {
        "title": "Document non horodaté dans Tezos Blockchain",
        "message": "Nous sommes désolés, votre fichier de preuve correspond au document que vous souhaitez vérifier et semble légitime. Cependant, nous ne pouvons pas trouver dans la blockchain une preuve de sa signature. Le hachage racine de l'arbre Merkle mentionné ({0}) n'est pas présent dans la blockchain "
      },
      "document_known_unknown_root_hash": {
        "title": "Document trouvé dans Tezos DigiSign mais non horodaté dans Tezos Blockchain",
        "message": "Nous sommes désolés. Selon notre base de données interne, nous devrions être en mesure de vous confirmer l'authenticité de votre document. Notre base de données nous informe que ce document a été signé par {0} - {1} le {2}. Cependant, nous ne pouvons pas trouver dans la blockchain la preuve que le document a bien été signé "
      },
      "incorrect_proof_file": {
        "title": "Le fichier de preuve ne peut pas être analysé",
        "message": "Le fichier de preuve que vous avez fourni n'est pas une preuve Tezos DigiSign V0 valide. Êtes-vous sûr que ce fichier de preuve a été généré par un outil respectant le protocole Tezos DigiSign V0 ?"
      },
      "incorrect_transaction": {
        "title": "Le fichier de preuve n'est pas cohérent",
        "message": "Le fichier de preuve que vous avez fourni n'est pas une preuve Tezos DigiSign V0 valide. Êtes-vous sûr que ce fichier de preuve a été généré par un outil respectant le protocole Tezos DigiSign V0? La transaction du fichier de preuve n'est pas valide. "
      },
      "transaction_not_deep_enough": {
        "title": "Le fichier de preuve est cohérent mais la signature est ancrée dans le blochain.",
        "message": "Le fichier de preuve que vous avez fourni est une preuve Tezos DigiSign V0 valide. la signature est ancrée dans la blockchain. Veuillez patienter un peu la fin de l'ancrage"
      },
      "incoherent_data": {
        "title": "Erreur interne",
        "message": "Nous sommes désolés, une erreur interne s'est produite lors de la vérification du document."
      },
      "no_transaction": {
        "title": "Document non horodaté dans Tezos Blockchain",
        "message": ": Nous sommes désolés, votre fichier de preuve correspond au document que vous souhaitez vérifier et semble légitime. Cependant, nous ne pouvons pas trouver dans la blockchain une preuve de sa signature. Le hachage racine de l'arbre Merkle mentionné ({0}) n'est pas présent dans la blockchain "
      },
      "incorrect_hash": {
        "title": "Le hash du document est différent du hash de la preuve",
        "message": "Nous sommes désolés, votre fichier de preuve ne correspond pas au document que vous voulez vérifier. En effet, le hash du document ({0}) n'est pas le hash du fichier de preuve ({1})."
      },
      "incorrect_origin_public_key": {
        "title": "Le compte Tezos de la preuve n'est pas géré par notre plateforme.",
        "message": "Nous sommes désolés, votre fichier de preuve fait référence à un compte Tezos inconnu de notre plateforme. En effet, le compte Tezos du fichier de preuve est {0} mais notre plateforme attend le compte Tezos {1}."
      },
      "incorrect_signature_date": {
        "title": "La date de signature du fichier de preuve est incorrecte",
        "message": "Nous sommes désolés, votre fichier de preuve a une date de signature incorrecte : {0}. La date de signature sur le blockchain Tezos est : {1}."
      },
      "incorrect_hash_algorithm": {
        "title": "L'algorithme de hash est incorrect",
        "message": "Nous sommes désolés, votre fichier a le mauvais algorithme de hash : {0}. Il ne correspond pas au hash fourni : {1}."
      },
      "unknown_hash_algorithm": {
        "title": "L'algorithme de hash est incorrect",
        "message": "Nons sommes désolé, votre fichier a le mauvais algorithme de hash : {0}. Le serveur ne le reconnaît pas."
      },
      "incorrect_public_key": {
        "title": "La clé publique du fichier de preuve est incorrecte",
        "message": "Nous sommes désolés, le fichier de preuve a la mauvaise clé publique  du signataire : {0}. La clé publique ancrée sur la blockchain Tezos est : {1}."
      },
      "incorrect_contract_address": {
        "title": "L'adresse du contract du fichier de preuve est incorrecte",
        "message": "Nous sommes désolés, le fichier de preuve a la mauvaise adresse du contract : {0}. Le serveur Digisign attend l'adresse de contrat suivante : {1}."
      },
      "internal_servor_error": {
        "title": "Le serveur n'a pas pu traité votre demande",
        "message": "Le serveur a rencontré une erreur interne lors du traitement de votre requête. Veuillez confirmer que le format du fichier de preuve est correct auprès du fournisseur."
      },
      "transaction_not_old_enough": {
        "title": "Le fichier de preuve est cohérent mais la signature est en cours d'encrage dans le blochain.",
        "message": "la signature est en cours d'encrage dans la blockchain. Veuillez patienter un peu la fin de l'ancrage"
      },
      "generic": {
        "title": "Hash de document non trouvé dans TEZOS DigiSign",
        "message": "Nous sommes désolés, nous ne reconnaissons pas ce document. Etes-vous sûr d'avoir la même version du fichier qu'au moment de sa signature ? Si ce n'est pas le cas, merci de mettre en ligne la version originale. Si le document est bon et qu'un fichier de preuve vous a été fourni, merci de le mettre en ligne également."
      }
    },
    "success": {
      "message1": {
        "block1": {
          "title": "Votre fichier est certifié.",
          "message": "Il a été signé par {0} le {1}"
        },
        "block2": {
          "line1": "Nous connaissions votre fichier sous le nom {0}.",
          "line2": "En utilisant l'algorithme {0}, votre fichier génère l'impression numérique ci-dessous (hachage): {1}",
          "line3": "Le processus de signature peut avoir inclus des documents supplémentaires en même temps. Nous avons utilisé un système connu sous le nom d'arbre Merkel pour générer une signature unique sur plusieurs documents simultanément. Cet arbre Merkel est identifié par son hachage racine {0}.",
          "line4": "Votre document, ainsi que le hachage racine, a été signé dans la transaction Tezos Blockchain {0}, présent dans le bloc Tezos {1}, le {2}. Il est désormais stocké dans un contrat intelligent",
          "line5": "Le document a été signé par une entité connue par sa clé publique Tezos unique {0}. L'opérateur de cette plateforme de vérification a reçu au préalable la confirmation que sa clé publique appartient à {1}.",
          "line6": "Cliquez {#} pour obtenir un fichier de preuve expliquant la relation entre l'impression numérique de votre document et le hachage racine de l'arbre Merkle. Avec ce fichier de preuve, vous pouvez prouver à quiconque que votre document a été signé et horodaté. Si vous le faites ne l'avez pas déjà, veuillez le conserver en lieu sûr avec votre document d'origine. ",
          "line7": "Cliquez {#} pour obtenir les informations techniques sur l'endroit où les informations sont stockées dans le contrat intelligent Tezos DigiSign (adresse du contrat: {0})."
        }
      },
      "message2": {
        "block1": {
          "title": "Votre fichier est certifié.",
          "message": "Il a été signé par {0} le {1}"
        },
        "block2": {
          "line1": "En utilisant l'algorithme {0}, votre fichier génère l'impression numérique ci-dessous (hachage): {1}",
          "line2": "Le processus de signature peut avoir inclus des documents supplémentaires en même temps. Un système sait que Merkel Tree a été utilisé pour générer une seule signature sur plusieurs documents simultanément. Cet Merkel Tree est identifié par son Root Hash {0}. ",
          "line3": "La preuve cryptographique que votre fichier fait partie de cet arbre Merkle a été obtenue en respectant les informations présentes dans le fichier de preuve:",
          "line4": "- Nous avons calculé et confirmé le hachage de votre document: {0}",
          "line5": "- Nous avons pris le résultat précédent et ajouté par concaténation sur son {0} un autre hachage: {1} et le résultat était {2}",
          "line6": "Ce dernier résultat se trouve en haut de l'arbre Merkle. Nous l'appelons le hachage racine de l'arbre Merkle: {0}",
          "line7": "Si votre document était différent de celui qui a été signé, le hachage racine serait différent",
          "line8": "Nous sommes alors entrés dans la blockchain, et nous pouvons confirmer que votre document avec le Root Hash, a été signé dans la transaction Tezos Blockchain {0}, présent dans le bloc Tezos {1}, le {2 }. Il est désormais stocké dans un contrat intelligent. ",
          "line9": "Le document a été signé par une entité connue par sa clé publique Tezos unique {0}. Sur la base de notre base de données interne, l'opérateur de cette plateforme de vérification a reçu au préalable la confirmation que sa clé publique appartient à {1}",
          "line10": "Cliquez {#} pour obtenir les informations techniques sur l'endroit où les informations sont stockées dans le contrat intelligent Tezos DigiSign (adresse du contrat: {0})."
        }
      },
      "message3": {
        "block1": {
          "title": "Votre fichier est certifié.",
          "message": "Il a été signé par {0} le {1}"
        },
        "block2": {
          "line8": "Nous sommes entrés dans la blockchain, et nous pouvons confirmer que votre document avec le Hash {0}, a été signé dans la transaction Tezos Blockchain le {1}. Il est désormais stocké dans un contrat intelligent. ",
          "line9": "Le document a été signé par une entité connue par sa clé publique Tezos unique {0}.",
          "line10": "Cliquez {#} pour obtenir les informations techniques sur l'endroit où les informations sont stockées dans le contrat intelligent Tezos DigiSign (adresse du contrat: {0})."
        }
      },
      "info": {
        "title": "Pour votre compréhension, voici une brève description des différentes étapes du processus de vérification.",
        "col1": {
          "title": "Avec document uniquement:",
          "step1": "Calculer le hachage SHA256 du document",
          "step2": "Vérifiez que le hachage du document est stocké dans la base de données de vérification Tezos DigiSign",
          "step3": "Récupérer la transaction contenant le hachage du document et le hachage racine de l'arbre Merkle associé",
          "step4": "Vérifiez que le hachage de la racine de l'arbre Merkle est stocké dans le contrat intelligent Tezos DigiSign"
        },
        "col2": {
          "title": "Avec document et fichier de preuve:",
          "step1": "Calculer le hachage SHA256 du document",
          "step2": "Vérifiez que le hachage du document correspond à la valeur de hash_document dans le fichier de preuve",
          "step3": "Calculez le hachage de la racine de l'arbre Merkle avec les données hash_list dans le fichier de preuve",
          "step4": "Vérifiez que le hachage racine du document Merkle correspond à la valeur hash_root dans le fichier de preuve",
          "step5": "Vérifiez que la valeur hash_document est stockée dans la base de données de vérification Tezos DigiSign",
          "step6": "Vérifiez que la valeur hash_root est stockée dans la base de données de vérification Tezos DigiSign",
          "step7": "Vérifiez que la valeur hash_root est stockée dans le contrat intelligent Tezos DigiSign"
        }
      }
    }
  },
  "signatureHandler": {
    "title": "Requête de signature",
    "fileName": "Nom",
    "size": "Taille",
    "hash": "Hash",
    "keyValue": "Clés & Valeurs",
    "sign": "Signer",
    "cancel": "Annuler",
    "upload": "Téléverser",
    "uploadFiles": "Téléversez vos fichiers",
    "algorithm": "Algorithme de hachage",
    "name": "Nom",
    "data": "Données",
    "start": "Démarrez votre job",
    "noData": "Aucun fichier déposé.",
    "mandatory": "* Informations obligatoires."
  },
  "errors": {
    "login": {
      "invalid": "Erreur sur votre login et/ou mot de passe.",
      "disabled": "Vous ne pouvez pas vous connecter car votre compte a été désactivé.\nPour plus d'informations, veuillez contacter votre administrateur.",
      "default": "Connexion impossible, veuillez contacter votre administrateur."
    },
    "password": {
      "differents": "Les mots de passe doivent être identiques.",
      "weak": "Le mot de passe doit contenir au moins 8 caractères, 1 majuscule, 1 minuscule, 1 nombre et 1 caractère spécial."
    },
    "account": {
      "duplicate": {
        "login": "Cet identifiant est déjà pris.",
        "email": "Cette adresse email est déjà utilisée par un autre compte."
      }
    },
    "back": {
      "generic": "Les informations n'ont pas pu être mises à jour, veuillez contacter votre administrateur."
    }
  },
  "message": {
    "footer": {
      "items-per-page-text": "Lignes par page :",
      "page-text": "{0}-{1} sur {2}"
    }
  },
  "calendar": {
    "label": {
      "reset": "Effacer",
      "close": "Fermer"
    }
  },
  "disableConfirm": {
    "title": "Désactiver l'utilisateur",
    "subTitle": "Êtes-vous sûr(e) de vouloir désactiver cet utilisateur ?",
    "content": "",
    "confirmButton": "Confirmer",
    "cancelButton": "Annuler"
  }
}
